app/views/posts/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<!-- Each of the "refactorpost" is an individual user generated refactor -->
      <% @post.comments.each do |comment| %>