app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "~~~ ruby\r\ndef my_long_function\r\n    n += 1\r\nend\r\n"], ["created_at", "2014-05-27 21:01:45.226989"], ["post_id", 1], ["updated_at", "2014-05-27 21:01:45.226989"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    if current_user.present?
    current_user.comments << @comment

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = 1
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 939642351]]
---
  def destroy
    @comment.destroy

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1049712694]]
---
  def set_post
    @post = Post.find(params[:post_id])

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 939642351]]
---
  def set_comment
    @comment = Comment.find(params[:id])