app/controllers/posts_controller.rb

  def index
    @posts = policy_scope(Post)
    if params[:filter]
      @posts = Post.filter(params[:filter]).includes(:comments).order("comments.created_at desc").order("posts.created_at desc")
---
SELECT "posts".* FROM "posts"  WHERE (title LIKE '%another%' OR language LIKE '%another%')  ORDER BY posts.created_at desc

  def create
    @post = Post.new(post_params)
    current_user.posts << @post
---
INSERT INTO "posts" ("author_id", "body", "created_at", "language", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1], ["body", "hmm"], ["created_at", "2014-07-13 06:34:06.863327"], ["language", "c"], ["title", "wddd"], ["updated_at", "2014-07-13 06:34:06.863327"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "language" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["language", "cpp"], ["updated_at", "2014-05-28 17:00:37.642208"]]